index=_internal source="*license_usage.log*" type=Usage earliest=-7d latest=now
| timechart span=1d sum(eval(round(b/1024/1024/1024,5))) AS usage by idx; index usage for last week, by index by day


index=your_index_name | stats dc(host) as unique_workstations; get unique hosts that have logged to a index

index="winregmon" host="XXXXXX" key_path="HKLM\\system\\StoreToLooksie*"; Get quantity of logs to particular store. 


index=wineventlog | stats count by host | sort -count | head 10;  most logs by host
index=wineventlog host="My-Host" | stats count by EventCode | sort -count | head 10; highest logged by top ten
you can also use tail 

